# Даны три стороны. Проверьте, можно ли построить треугольник (сумма двух любых сторон больше третьей).
# a,b,c=int(input("Введите первое число: ")),int(input("Введите второе: ")),int(input("Введите третье: "))
# if a+b>c:
#     print("YES")
# else:
#     print("NO")

# Определите, является ли год високосным.
# Правило: год делится на 4, но не на 100, либо делится на 400
# a=int(input("Введите год: "))
# if (a%4==0 and a%100!=0) or a%400==0:
#     print("YES")
# else:
#     print("NO")

# Напишите программу, которая запрашивает у пользователя число и выводит, является ли оно чётным или нечётным
# a=int(input("Введите число: "))
# if a%2==0:
#     print("Чёткое")
# else:
#     print("Васянское")

# Определите знак введённого числа.
# a=int(input("Введите число: "))
# if a>0:
#     print("Плюс")
# elif a==0:
#     print("Ноль")
# else:
#     print("Минус")

# Пользователь вводит балл (0–100). Выведите оценку:
#
# 90–100 → «Отлично»
# 75–89 → «Хорошо»
# 60–74 → «Удовлетворительно»
# 0–59 → «Неудовлетворительно»
a=int(input("Введите свой балл: "))
if a>=90:
    print("Отлично")
elif a>=75:
    print("Хорошо")
elif a>=60:
    print("Удовлетворительно")
else:
    print("Неудовлетворительно")